# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  #- [10,13, 16,30, 33,23]  # P3/8
  #- [30,61, 62,45, 59,119]  # P4/16
  #- [116,90, 156,198, 373,326]  # P5/32
  #k_mean聚类
  - [33,33,  45,47,  60,60]  # P3/8
  - [80,81,  107,116,  143,162]  # P4/16
  - [176,276,  230,230,  288,362]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16  5
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9

   #[-10, 1, Focus, [64, 3]],  # 10-P1/2
   #主backbone
   [-9, 1, DBLayer, [64,1,2]],
   [[-1, 0], 1, Concat, [1]],
   [-1, 1, Conv, [128, 3, 2]],

   [-11, 1, DBLayer, [64,1,1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, C3, [128]], # p2

   [-13, 1, DBLayer, [128,1,2]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [256, 3, 2]],

   [-15, 1, DBLayer, [128,1,1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 9, C3, [256]], #21  p3

   [-17, 1, DBLayer, [256,1,2]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [512, 3, 2]],

   [-19, 1, DBLayer, [256,1,1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 9, C3, [512]],  #27  P4

   [-21, 1, DBLayer, [512,1,2]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 3, 2]],

   [-23, 1, DBLayer, [512,1,1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],

   [-25, 1, DBLayer, [512,1,1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],  # 36

  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #37
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 27], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, CoordAtt, [1024,16,16]],#40
   [-1, 3, C3, [512, False]],  # 41 (p2)

   [-1, 1, nn.Upsample, [None, 4, 'nearest']],
   [[-1, 15], 1, Concat, [1]],

   [-1, 1, Convv, [256, 1, 1]],  #16*16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 21], 1, Concat, [1]],  # cat backbone P3 44
   [-1, 1, CoordAtt, [512,32,32]],#45
   [-1, 3, C3, [256, False]],  # 46(P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 39], 1, Concat, [1]],  # cat head P4 48
   [-1, 1, CoordAtt, [1280,16,16]],#49
   [-1, 3, C3, [512, False]],  # 50 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 37], 1, Concat, [1]],  # cat head P5 52
   [-1, 1, CoordAtt, [1024,8,8]],#53
   [-1, 3, C3, [1024, False]],  # 54(P5/32-large)

   [[46, 50, 54], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
